In [1]:
import os
import mysql.connector
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
%matplotlib inline

In [2]:
user_name = os.environ.get('DB_USER')
user_pass = os.environ.get('DB_PASS')

In [6]:
connection = mysql.connector.connect(host='localhost',
                                     user = 'root',
                                     passwd = 'root2020',
                                     db = 'university')

In [7]:
connection

In [8]:
university_tables = pd.read_sql_query('SHOW TABLES FROM university', connection)

In [9]:
university_tables

  Tables_in_university
0         twitter_data

In [10]:
tables = university_tables['Tables_in_university']

In [12]:
for table_name in tables:
    output = pd.read_sql_query('DESCRIBE {}'.format(table_name),connection)
    print(table_name)
    print(output, '\n')

twitter_data
      Field             Type Null Key Default Extra
0     Tweet  b'varchar(280)'  YES        None
1      User   b'varchar(50)'  YES        None
2      Name   b'varchar(50)'  YES        None
3  location   b'varchar(50)'  YES        None